{
    "posts": [
      {
        "sub_id": 1,
        "id": 1,
        "type": 1,
        "title": "The Extra Life Charity Award — Raise awareness for children's hospitals through gilding!",
        "description": "TL;DR Today we launched an Extra Life Award to help raise money and awareness for Extra Life, a 24-hour gaming marathon charity benefiting Children's Miracle Network Hospitals! This new award is available alongside Silver, Gold, and Platinum from now through Nov. 2, and Reddit will match the first $15,000 of ALL Coins purchased during this time.\n\nPurchase Coins today and help support children's hospitals!       \n\nHere are a few details about the limited Extra Life Award:       \n  The award costs 500 Coins—the same cost as the Gold award\n  The recipient receives a week of Premium and 100 coins—the same benefits as Gold!\n  Anyone who gives this award, I'm told, has a heart of gold! (And also a shiny, new trophy at a later date!)\n  Reddit will match the first $15,000 of ALL Coin purchases from now through Nov. 2.\n\nBut why?\n\nLast week we announced our 8th year partnering with Extra Life for our favorite annual tradition: playing 24 25 hours of video games to help raise money for sick kids. We're not doing this alone! Thanks to some truly heroic redditors, we have already raised over $40,000 of our $150,000 goal!      \n\nHowever, we recognize not everyone can relinquish the majority of their weekend to play video games (we totally had other plans, we swear). We made this award to make it easier for even more people to get involved and help support one of our favorite charity events.\n\nHave the opposite problem? If your wallet is feeling thin, you can also help by signing up to fundraise! Check out our recent post for more details about joining Team Reddit.\n\nReminder: Extra Life Game Day is November 2nd!\n\nOn this coming Saturday a raiding party of staffers here at Reddit HQ will be streaming our fundraising efforts live on our Twitch stream. Tune in and join us for 25 hours of mind-melting gaming and delirious, sleep-deprived antics. From Fortnite to Untitled Goose Game, we'll be playing a variety of games, so join us and you may even get to play head-to-head against an admin in your favorite game!",
        "flair": null,
        "username": "sodypop",
        "date": "1 month ago",
        "likes": "22.6k",
        "comments": "825",
        "sticky": false
      },
      {
        "sub_id": 1,
        "id": 2,
        "type": 1,
        "title": "Changes to Our Policy Against Bullying and Harassment",
        "description": "TL;DR is that we’re updating our harassment and bullying policy so we can be more responsive to your reports.\n\nHey everyone,\n\nWe wanted to let you know about some changes that we are making today to our Content Policy regarding content that threatens, harasses, or bullies, which you can read in full here.\n\nWhy are we doing this? These changes, which were many months in the making, were primarily driven by feedback we received from you all, our users, indicating to us that there was a problem with the narrowness of our previous policy. Specifically, the old policy required a behavior to be “continued” and/or “systematic” for us to be able to take action against it as harassment. It also set a high bar of users fearing for their real-world safety to qualify, which we think is an incorrect calibration. Finally, it wasn’t clear that abuse toward both individuals and groups qualified under the rule. All these things meant that too often, instances of harassment and bullying, even egregious ones, were left unactioned. This was a bad user experience for you all, and frankly, it is something that made us feel not-great too. It was clearly a case of the letter of a rule not matching its spirit.\n\nThe changes we’re making today are trying to better address that, as well as to give some meta-context about the spirit of this rule: chiefly, Reddit is a place for conversation. Thus, behavior whose core effect is to shut people out of that conversation through intimidation or abuse has no place on our platform.\n\nWe also hope that this change will take some of the burden off moderators, as it will expand our ability to take action at scale against content that the vast majority of subreddits already have their own rules against-- rules that we support and encourage.\n\nHow will these changes work in practice? We all know that context is critically important here, and can be tricky, particularly when we’re talking about typed words on the internet. This is why we’re hoping today’s changes will help us better leverage human user reports. Where previously, we required the harassment victim to make the report to us directly, we’ll now be investigating reports from bystanders as well. We hope this will alleviate some of the burden on the harassee.\n\nYou should also know that we’ll also be harnessing some improved machine-learning tools to help us better sort and prioritize human user reports. But don’t worry, machines will only help us organize and prioritize user reports. They won’t be banning content or users on their own. A human user still has to report the content in order to surface it to us. Likewise, all actual decisions will still be made by a human admin.\n\nAs with any rule change, this will take some time to fully enforce. Our response times have improved significantly since the start of the year, but we’re always striving to move faster. In the meantime, we encourage moderators to take this opportunity to examine their community rules and make sure that they are not creating an environment where bullying or harassment are tolerated or encouraged.\n\nWhat should I do if I see content that I think breaks this rule? As always, if you see or experience behavior that you believe is in violation of this rule, please use the report button [“This is abusive or harassing > “It’s targeted harassment”] to let us know. If you believe an entire user account or subreddit is dedicated to harassing or bullying behavior against an individual or group, we want to know that too; report it to us here.\n\nThanks. As usual, we’ll hang around for a bit and answer questions.\n\nEdit: typo. Edit 2: Thanks for your questions, we're signing off for now!",
        "flair": null,
        "username": "landoflobsters",
        "date": "2 months ago",
        "likes": "17.0k",
        "comments": "10.4k",
        "sticky": false
      },
      {
        "sub_id": 1,
        "id": 3,
        "type": 1,
        "title": "Sequence Initiated.",
        "description": "We built a machine.\n\nWe're not sure what it will do.\n\nThat's all up to you.\n\n\n\n--- SEQUENCE ---\n\n\n\n\n\n\n\nBe good to each other.",
        "flair": null,
        "username": "youngluck",
        "date": "8 months ago",
        "likes": "26.3k",
        "comments": "2.1k",
        "sticky": false
      },
      {
        "sub_id": 1,
        "id": 4,
        "type": 1,
        "title": "Fear is the path to the dark side… Introducing NIGHT MODE",
        "description": "Are you a creature-of-the-night type of person? A straight-up vampire? Or just a redditor that wants to browse in night mode? Then you’ll be happy to hear: Night Mode has (finally) landed so you can read Reddit without searing your retinas (we heard it’s a thing).\n\nWe want to give you guys more choice in how you browse new Reddit, and Night Mode has been a top feature request in the r/redesign community, so a few months ago we set out to build it.\n\n...Annnnd now it’s been awhile since we first announced Night Mode was coming. Turns out creating and implementing a color system to incorporate a new theme is tough. But our design and engineering teams were undaunted: dive under the hood of the Design & Engineering effort to build Night Mode on the blog.\n\nTo start browsing Reddit in darkness, click on your username in the upper right hand corner, and then toggle it on. If you're on old Reddit, you can visit http://new.reddit.com/ to try out Night Mode. If you enjoy it, you can opt for it to be your default experience by selecting Opt In under Night Mode.\n\nWe hope you’ll enjoy this retina-saving feature as much as we do. But seriously jokes aside, we are continuously trying to improve Reddit for y'all and we'll post more soon. Let us know your thoughts on Night Mode.\n\nNext week we’ll be providing an update about accessibility in the Redesign. While you wait, check out our other recent updates",
        "flair": null,
        "username": "Whuuu",
        "date": "1 year ago",
        "likes": "9.4k",
        "comments": "2.6k",
        "sticky": false
      }
    ]
}